# Subsetting and Descriptive Stats - Challenge 3

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [2]:
# your code here
url = 'https://raw.githubusercontent.com/evapanizo/IronHack-Data-Module-2/master/01.-Subsetting-And-Descriptive-Stats/your-code/data/Orders.csv'
orders = pd.read_csv(url)

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [3]:
# your code here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [4]:
orders.shape

(397924, 14)

In [5]:
orders.sample()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
19513,30014,538839,85114B,2010,12,2,13,ivory enchanted forest placemat,4,2010-12-14 13:10:00,1.65,14606,United Kingdom,6.6

In [6]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [7]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [8]:
# your code here

print(orders['UnitPrice'].mean())

3.116174480549152

####  What is the median purchase price?

In [9]:
# your code here

orders['UnitPrice'].quantile()
# or 
orders['UnitPrice'].median()

1.95

####  What is the most frequent purchase price?

In [10]:
# your code here

orders['UnitPrice'].mode()
# or
orders['UnitPrice'].value_counts().head(1)

1.25    45841
Name: UnitPrice, dtype: int64

#### What are the highest and lowest purchase prices?

In [11]:
# your code here
print(orders.UnitPrice.min())
print(orders.UnitPrice.max())

0.0
8142.75

#### Select all the customers from Spain.
**Hint**: Remember that a customer might have more than one order associated.

In [12]:
# your code here
spain = orders[orders.Country == 'Spain']['CustomerID'].unique()
# or
spain2 = pd.DataFrame(orders.groupby('Country').nunique()['CustomerID'])

print(type(spain))
print(spain)
print(type(spain2))
print(spain2)

<class 'numpy.ndarray'>
[12557 17097 12540 12551 12484 12539 12510 12421 12502 12462 12507 12541
 12547 12597 12545 12596 12354 12417 12455 12450 12548 12556 12550 12546
 12454 12448 12544 12538 12445 12442]
<class 'pandas.core.frame.DataFrame'>
                      CustomerID
Country
Australia                      9
Austria                       11
Bahrain                        2
Belgium                       25
Brazil                         1
Canada                         4
Channel Islands                9
Cyprus                         8
Czech Republic                 1
Denmark                        9
EIRE                           3
European Community             1
Finland                       12
France                        87
Germany                       94
Greece                         4
Iceland                        1
Israel                         3
Italy                         14
Japan                          8
Lebanon                        1
Lithuania                      1
Malta                          2
Netherlands                    9
Norway                        10
Poland                         6
Portugal                      19
RSA                            1
Saudi Arabia                   1
Singapore                      1
Spain                         30
Sweden                         8
Switzerland                   21
USA                            4
United Arab Emirates           2
United Kingdom              3921
Unspecified                    4

#### How many are there?

In [13]:
# your code here
print(len(spain))

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [14]:
# your code here
ordersbyqty = orders.groupby('CustomerID').sum()
print(len(ordersbyqty))
ordersbyqty

4339

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60
12347,42441700,101296926,365971,1383,441,2219,2458,481.21,4310.00
12348,2807120,16869685,62324,257,111,472,2341,178.71,1797.24
12349,35444274,42165457,146803,803,73,657,631,605.10,1757.55
12350,1365627,9231629,34187,34,51,272,197,65.30,334.40
...,...,...,...,...,...,...,...,...,...
18280,1110495,5457120,20110,30,10,90,45,47.65,180.60
18281,1560699,3895248,14077,42,49,70,54,39.36,80.82
18282,4642134,6838540,24132,116,60,146,103,62.39,178.05
18283,233950830,425704048,1520316,5503,2489,10346,1397,1220.93,2094.88
18287,21958901,39474556,140770,555,332,697,1586,104.55,1837.28

In [15]:
# your code here
ordersmore50 = ordersbyqty[ordersbyqty['Quantity']>50]
print(len(ordersmore50))
ordersmore50

4091

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,amount_spent
CustomerID,,,,,,,,,
12346,61619,541431,2011,1,2,10,74215,1.04,77183.60
12347,42441700,101296926,365971,1383,441,2219,2458,481.21,4310.00
12348,2807120,16869685,62324,257,111,472,2341,178.71,1797.24
12349,35444274,42165457,146803,803,73,657,631,605.10,1757.55
12350,1365627,9231629,34187,34,51,272,197,65.30,334.40
...,...,...,...,...,...,...,...,...,...
18278,3262446,5116428,18099,81,18,99,66,29.55,173.90
18281,1560699,3895248,14077,42,49,70,54,39.36,80.82
18282,4642134,6838540,24132,116,60,146,103,62.39,178.05
18283,233950830,425704048,1520316,5503,2489,10346,1397,1220.93,2094.88
18287,21958901,39474556,140770,555,332,697,1586,104.55,1837.28

#### Select orders from Spain that include more than 50 items.

In [17]:
# your code here
spain50 = orders[(orders.Quantity>50) & (orders.Country == 'Spain')]
spain50.shape
spain50.sample()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
32457,52419,540785,84997A,2011,1,2,11,green 3 piece polkadot cutlery set,144,2011-01-11 11:39:00,3.39,12557,Spain,488.16

#### Select all free orders.

In [18]:
# your code here
print(orders[orders['amount_spent']==0].shape)
orders[orders['amount_spent']==0].sample()

(40, 14)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
137127,198383,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Australia,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [19]:
# your code here
o = orders[orders.Description.str.startswith("lunch bag")]
print(o.sample())
o.shape

        Unnamed: 0  InvoiceNo StockCode  year  month  day  hour  \
213496      303313     563538     22662  2011      8    3    11

                        Description  Quantity          InvoiceDate  UnitPrice  \
213496  lunch bag dolly girl design         1  2011-08-17 11:48:00       1.65

        CustomerID         Country  amount_spent
213496       17841  United Kingdom          1.65

(11556, 14)

#### Select all `lunch bag` orders made in 2011.

In [20]:
# your code here
o2011 = orders[(orders.Description.str.startswith("lunch bag")) & (orders.year==2011)]
print(o2011.shape)
o2011.sample()

(11234, 14)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
143962,207154,554977,20728,2011,5,7,11,lunch bag cars blue,1,2011-05-29 11:03:00,1.65,16444,United Kingdom,1.65

#### Show the frequency distribution of the amount spent in Spain.

In [24]:
# your code here
orders[orders['Country']=='Spain']['amount_spent'].value_counts()

15.00     186
17.70     122
19.80      99
17.40      86
10.20      76
         ...
29.85       1
7.56        1
280.00      1
360.00      1
4.74        1
Name: amount_spent, Length: 316, dtype: int64

#### Select all orders made in the month of August.

In [25]:
# your code here
aug = orders[orders.month==8]
len(aug)

27013

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [26]:
# your code here
aug = orders[orders.month==8]['Country'].value_counts()
print(aug)

United Kingdom     23105
Germany              795
EIRE                 593
France               569
Netherlands          280
Switzerland          267
Spain                252
Belgium              194
Israel               171
Channel Islands      140
Australia            107
Italy                 95
Austria               88
Norway                77
Finland               61
Malta                 55
Portugal              41
Sweden                40
Unspecified           23
Iceland               22
Poland                17
Denmark               16
Canada                 5
Name: Country, dtype: int64

#### What's the  average amount of money spent by country?

In [27]:
# your code here
orders.groupby('Country').mean()['amount_spent']

Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615
Name: amount_spent, dtype: float64

In [28]:
# your code here
orders.UnitPrice.max()
orders[orders.UnitPrice==8142.75][['Description','UnitPrice']]
print(orders[orders.UnitPrice==orders.UnitPrice.max()][['Description','UnitPrice']])

       Description  UnitPrice
118352     postage    8142.75

In [29]:
# your code here
orders.loc[orders.UnitPrice==orders.UnitPrice.max(),['Description','UnitPrice']]

       Description  UnitPrice
118352     postage    8142.75

In [30]:
# In a different order:
orders[['Description','UnitPrice']][orders.UnitPrice==orders.UnitPrice.max()]

       Description  UnitPrice
118352     postage    8142.75

#### What is the average amount spent per year?

In [31]:
# your code here
pd.DataFrame(orders.groupby('year').mean()['amount_spent'])
# or
pd.DataFrame(orders.groupby('year')['amount_spent'].mean())

      amount_spent
year
2010     21.892733
2011     22.430074

#### What is the total quantity sold per year and per amount spent?

In [32]:
# your code here
pd.DataFrame(orders.groupby(['year','amount_spent']).sum()['Quantity'])

                   Quantity
year amount_spent
2010 0.00                15
     0.14                 2
     0.18                 1
     0.21                 8
     0.29                34
...                     ...
2011 7144.72           1412
     8142.75              1
     38970.00            60
     77183.60         74215
     168469.60        80995

[3551 rows x 1 columns]

#### What is the total quantity sold per amount spent and then per year ?

In [33]:
# your code here
pd.DataFrame(orders.groupby(['amount_spent','year']).sum()['Quantity'])

                   Quantity
amount_spent year
0.000        2010        15
             2011     13869
0.001        2011         4
0.060        2011         1
0.080        2011         1
...                     ...
7144.720     2011      1412
8142.750     2011         1
38970.000    2011        60
77183.600    2011     74215
168469.600   2011     80995

[3551 rows x 1 columns]

#### What is the number of customers for each specific item sold?

In [34]:
# your code here

orders.groupby('Description').count().sort_values(by='CustomerID', ascending=False)['CustomerID']

Description
white hanging heart t-light holder    2028
regency cakestand 3 tier              1724
jumbo bag red retrospot               1618
assorted colour bird ornament         1408
party bunting                         1397
                                      ...
letter "z" bling key ring                1
glass bell jar large                     1
white stone/crystal earrings             1
crochet lilac/red bear keyring           1
pearl & shell 42"neckl. ivory            1
Name: CustomerID, Length: 3877, dtype: int64